Catalogs/АР_ПланировкиПомещенийИПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ПланировкиПомещенийИПлощадей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лист</Name>
					<Comment>Лист рабочей книги файла шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрОбъект</Name>
					<Comment>Имя графического объекта на рабочем листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПланировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ФайлыПланировокПомещенийИПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ЗданияИЭтажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ЗданияИЭтажи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеНаПлане</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ПланировкиПомещенийИПлощадей/Forms/ФормаЗаполненияСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем СписокЛистов;

&НаКлиенте
Перем Книга;

&НаКлиенте
Перем Excell;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ПрочитатьСписокЛистов()
	
	СписокЛистов = Новый Массив;
	Если Не ЗначениеЗаполнено(ФайлПланировки) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	Если Книга = Неопределено Тогда
		ОткрытьКнигу(Отказ);
	КонецЕсли;
	
	Если не Отказ Тогда
		Для Ном = 1 по Книга.Sheets().Count() Цикл
			СписокЛистов.Добавить(Книга.Sheets(Ном).Name);
		КонецЦикла;
	КонецЕсли;
	
	Элементы.Лист.СписокВыбора.ЗагрузитьЗначения(СписокЛистов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКнигу(Отказ)
	
	ПолноеИмяФайла = АР_ОбщиеПроцедуры.ПолучитьПутьКФайлуПланировки(ФайлПланировки);
	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл """ + СокрЛП(ПолноеИмяФайла) + """ не существует!", СтатусСообщения.Важное);
		Отказ = Истина;
	Иначе
		Книга = Excell.Workbooks.Open(ПолноеИмяФайла,, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьСправочникПланировок(ИмяОбъекта, ИмяОбласти)

	НовыйОбъект = Справочники.АР_ПланировкиПомещенийИПлощадей.СоздатьЭлемент();
	НовыйОбъект.Наименование = Префикс + "-" + ИмяОбъекта;
	НовыйОбъект.Родитель = Группа;
	НовыйОбъект.ФайлПланировки = ФайлПланировки;
	НовыйОбъект.Лист = Лист;
	НовыйОбъект.ГрОбъект = ИмяОбъекта;
	Если ЗначениеЗаполнено(ИмяОбласти) Тогда
		НовыйОбъект.ОбластьТекста = ИмяОбласти;
	КонецЕсли;		
	ЗаписатьСправочникОбъект(НовыйОбъект);

	Если СоздаватьОбъекты Тогда
		СоздатьСправочникОбъектовАренды(ИмяОбъекта, НовыйОбъект);
	КонецЕсли;
	
КонецПроцедуры // СоздатьСправочникПланировок()

&НаСервере
Процедура СоздатьСправочникОбъектовАренды(ИмяОбъекта, СправочникПланировок)

	ОбъектАренды = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	ОбъектАренды.ТипОбъекта = ТипОбъекта;
	ОбъектАренды.РасположениеНаПлане = СправочникПланировок.Ссылка;
	ОбъектАренды.Родитель = ГруппаОбъектов;
	ОбъектАренды.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	ОбъектАренды.Наименование = Префикс + "-" + ИмяОбъекта;
	ОбъектАренды.ЗданиеИЭтаж = ЗданиеИЭтаж;
	ОбъектАренды.КатегорияЦен = КатегорияЦен;
	ОбъектАренды.ЕдиницаИзмерения = ЕдиницаИзмерения;
	ЗаписатьСправочникОбъект(ОбъектАренды);
	Если ЗначениеЗаполнено(ЗданиеИЭтаж) И Не ЗначениеЗаполнено(ЗданиеИЭтаж.РасположениеНаПлане) Тогда
		ОбъектЗданиеИЭтаж = ЗданиеИЭтаж.ПолучитьОбъект();
		ОбъектЗданиеИЭтаж.РасположениеНаПлане = СправочникПланировок.Ссылка;
		ОбъектЗданиеИЭтаж.Записать();
	КонецЕсли;

КонецПроцедуры // СоздатьСправочникОбъектовАренды()

&НаСервере
Процедура СоздатьСправочникЗданийИЭтажей(Наименование)

	ОбъектЗданиеИЭтаж = Справочники.АР_ЗданияИЭтажи.СоздатьЭлемент();
	ОбъектЗданиеИЭтаж.Наименование = Наименование;
	ОбъектЗданиеИЭтаж.ПолноеНаименование = Наименование;
	ЗаписатьСправочникОбъект(ОбъектЗданиеИЭтаж);
	ЗданиеИЭтаж = ОбъектЗданиеИЭтаж.Ссылка;

КонецПроцедуры // СоздатьСправочникЗданийИЭтажей()

&НаСервере
Процедура ЗаписатьСправочникОбъект(СправочникОбъект, Сообщать = Истина)

	Если НЕ СправочникОбъект.Модифицированность() Тогда
		Возврат;
	КонецЕсли;

	Если СправочникОбъект.ЭтоНовый() Тогда
		СтрСообщения1 = "Создан";
	Иначе
		СтрСообщения1 = "Обработан";
	КонецЕсли;

	Если СправочникОбъект.ЭтоГруппа Тогда
		СтрСообщения2 = "а группа";
	Иначе
		СтрСообщения2 = " элемент";
	КонецЕсли;

	СтрСообщения2 = СтрСообщения2 + " справочника """ + СправочникОбъект.Метаданные().Синоним + """: ";
	СтрСообщения3 = "наименование """ + СправочникОбъект.Наименование + """";

	Попытка
		СправочникОбъект.Записать();
		Если Сообщать = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСообщения1 + СтрСообщения2 + "код """ + СправочникОбъект.ПолныйКод() + """, " + СтрСообщения3);
		КонецЕсли; 
		
	Исключение
		ОбщегоНазначенияБПКлиентСервер.СообщитьОбОшибке("Не записан"  + СтрСообщения2 + СтрСообщения3 +
		         Символы.ПС + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.РеквизитыДляСоздания.Доступность = Ложь;
	
	ТипОбъекта = Константы.АР_ТипОбъектаАренды.Получить();
    ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Excell = Новый COMОбъект("Excel.Application");
	Книга = Неопределено;
	СписокЛистов = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ФайлПланировки) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Лист"));
	КонецЕсли;
	Если Не СоздаватьОбъекты Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ГруппаОбъектов"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТипОбъекта"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЕдиницаИзмерения"));
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СоздатьЗданиеИЭтажНажатие(Команда)
	Перем Наименование;
	
	Если ВвестиСтроку(Наименование, "Введите название здания и этажа") Тогда
		СоздатьСправочникЗданийИЭтажей(Наименование);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		
		Отказ = Ложь;
		Если Книга = Неопределено Тогда
			ОткрытьКнигу(Отказ);
		КонецЕсли;
		
		План = Книга.Sheets(Лист);
		
		СписокОбъектов = Новый СписокЗначений;
		СписокТекстбоксов = Новый СписокЗначений;
		Для Ном = 1 по План.Shapes().Count() Цикл
			Если План.Shapes(Ном).Type() = 17 Тогда
				СписокТекстбоксов.Добавить(План.Shapes(Ном).Name);
			ИначеЕсли (План.Shapes(Ном).Type() = 5) ИЛИ (План.Shapes(Ном).Type() = 1 И (План.Shapes(Ном).AutoShapeType < 105 
					ИЛИ План.Shapes(Ном).AutoShapeType > 108)) Тогда
				СписокОбъектов.Добавить(План.Shapes(Ном).Name);
			КонецЕсли;
		КонецЦикла;

		Для Каждого Элемент Из СписокОбъектов Цикл
			Объект = План.Shapes(Элемент.Значение);
			// Ищем текстбокс для объекта
			ОбъектТекст = Неопределено;
			Для Каждого ЭлементТекст Из СписокТекстбоксов Цикл
				ОбъектТекст = План.Shapes(ЭлементТекст.Значение); 
				Если Объект.Left <= ОбъектТекст.Left И Объект.Top <= ОбъектТекст.Top
					И Объект.Left + Объект.Width >= ОбъектТекст.Left + ОбъектТекст.Width И Объект.Top + Объект.Height >= ОбъектТекст.Top + ОбъектТекст.Height Тогда // Нашли текстбокс
					Прервать;
				Иначе
					ОбъектТекст = Неопределено;
				КонецЕсли;
			КонецЦикла;
			
			ИмяОбласти = ?(ОбъектТекст = Неопределено, "", ОбъектТекст.Name);
			
			СоздатьСправочникПланировок(Объект.Name, ИмяОбласти);
			
		КонецЦикла;
		
		Книга.Close(Ложь);
		Книга = Неопределено;	
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СоздаватьОбъектыПриИзменении(Элемент)

	Элементы.РеквизитыДляСоздания.Доступность = ЭтаФорма.СоздаватьОбъекты;

КонецПроцедуры

&НаКлиенте
Процедура ЛистНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если СписокЛистов = Неопределено Тогда
		ПрочитатьСписокЛистов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбъектовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбораГруппы");
	ГруппаОбъектов = ФормаВыбора.ОткрытьМодально();
	
КонецПроцедуры
